app/Views/admin/dashboard.php

                    <?php
                        // Recupero regole usando WHERE per evitare errori di ID
                        $confModel = new \App\Models\ConfigurazioniModel();
                        $dataDb = $confModel->where('chiave', 'regole_fedelta')->first();
---
SELECT *
FROM "configurazioni"
WHERE "chiave" = 'regole_fedelta'
 LIMIT 1