app/Views/admin/ordini.php

SELECT *
FROM "prodotti"
---
    // PREPARAZIONE DATI MAGAZZINO PER JAVASCRIPT
    // ============================================================
    $db = \Config\Database::connect();
    $listaProdotti = $db->table('prodotti')->get()->getResultArray();