app/Controllers/AdminOrdini.php

    public function index()
    {
        if (session()->get('ruolo') != 'admin') {
            return redirect()->to('/');
        }

        $ordiniModel = new OrdiniModel();
        $ordini = $ordiniModel->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM "ordini"
ORDER BY "created_at" DESC