app/Controllers/Admin.php

    public function index()
    {
        if (session()->get('ruolo') != 'admin') return redirect()->to('/');
        $model = new ProdottiModel();
        $data['prodotti'] = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM "prodotti"
ORDER BY "id" DESC

    public function statistiche()
    {
        if (session()->get('ruolo') != 'admin') return redirect()->to('/');

        $ordiniModel = new OrdiniModel();

        $filtroGiorno = $this->request->getGet('giorno');
        $filtroMese   = $this->request->getGet('mese');
        $filtroAnno   = $this->request->getGet('anno') ?: date('Y');

        $query = $ordiniModel->where('stato !=', 'Annullato');

        if (!empty($filtroGiorno)) {
            $query->where("CAST(created_at AS DATE) = '$filtroGiorno'", null, false);
            $labelFiltro = "Giorno: " . date('d/m/Y', strtotime($filtroGiorno));
        } else {
            $query->where("EXTRACT(YEAR FROM created_at) = $filtroAnno", null, false);
            if (!empty($filtroMese)) {
                $query->where("EXTRACT(MONTH FROM created_at) = $filtroMese", null, false);
                $labelFiltro = "Mese: $filtroMese/$filtroAnno";
            } else {
                $labelFiltro = "Anno: $filtroAnno";
            }
        }

        $ordini = $query->findAll();

        $totaleAnno = $ordiniModel->where('stato !=', 'Annullato')
                                  ->where("EXTRACT(YEAR FROM created_at) = $filtroAnno", null, false)
                                  ->selectSum('totale')
                                  ->first();
---
SELECT *
FROM "ordini"
WHERE "stato" != 'Annullato'
AND EXTRACT(YEAR FROM created_at) = 2026
SELECT SUM("totale") AS "totale"
FROM "ordini"
WHERE "stato" != 'Annullato'
AND EXTRACT(YEAR FROM created_at) = 2026
 LIMIT 1