app/Controllers/Auth.php

SELECT *
FROM "utenti"
WHERE "email" = 'admin@gmail.com'
 LIMIT 1
---
    public function loginAuth()
    {
        $session = session();
        $model = new UtentiModel();

        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        // Cerca l'utente nel database
        $data = $model->where('email', $email)->first();

SELECT COUNT(*) AS "numrows" FROM "utenti"
---
        $utentiModel = new \App\Models\UtentiModel();

        // Contiamo gli utenti
        $numeroUtenti = $utentiModel->countAll();

INSERT INTO "utenti" ("nome", "email", "password", "ruolo") VALUES ('Admin', 'admin@gmail.com', '$2y$12$V3plhQFaf0teGoRFelp0G.jh5AHrTyFXCW5gWiKyClZ6DdrPpSnqO', 'admin')
---
            'ruolo'    => $ruoloAssegnato
        ];

        $utentiModel->save($data);