app/Controllers/Home.php

    public function index()
    {
        // SE L'UTENTE È UN ADMIN, LO DISCONNETTIAMO SE PROVA AD ENTRARE NELLA HOME CLIENTE
        if (session()->get('ruolo') == 'admin') {
            session()->destroy();
            return redirect()->to('/login')->with('msg', 'Accesso negato: gli amministratori non possono navigare la Home cliente.');
        }

        $model = new ProdottiModel();
        $data['prodotti'] = $model->findAll();
---
SELECT *
FROM "prodotti"